cases/supersonicEjector/rCF_clean/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           volVectorField;
    location        "0.01";
    object          U;
}

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    axis
    {
        type            empty;
    }
    inletMain
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0); 
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0); 
    }
    inletSecondary
    {
        type            pressureInletOutletVelocity;
        tangentialVelocity uniform ( 0 0 0 );
        value           uniform (0 0 0); 
    }
    wallNozzle1
    {
        type            noSlip;
    }
    wallInletSecondary
    {
        type            noSlip;
    }
    wallDiffuser
    {
        type            noSlip;
    }
    back
    {
        type            wedge;
    }
    front
    {
        type            wedge;
    }
}


// ************************************************************************* //
