cases/supersonicEjector/rCF_clean/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          omega;
}

dimensions      [ 0 0 -1 0 0 0 0 ];

internalField   uniform 200;

boundaryField
{
    cyclic
    {
        type            cyclic;
    }
    cyclicAMI
    {
        type            cyclicAMI;
        value           uniform 200;
    }
    cyclicACMI
    {
        type            cyclicACMI;
        value           uniform 200;
    }
    cyclicSlip
    {
        type            cyclicSlip;
    }
    empty
    {
        type            empty;
    }
    nonuniformTransformCyclic
    {
        type            nonuniformTransformCyclic;
    }
    processor
    {
        type            processor;
    }
    processorCyclic
    {
        type            processorCyclic;
    }
    symmetryPlane
    {
        type            symmetryPlane;
    }
    symmetry
    {
        type            symmetry;
    }
    wedge
    {
        type            wedge;
    }
    overset
    {
        type            overset;
    }
    wall
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 200;
    }
    "inlet.*"
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.001;
        value           uniform 200;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 200;
        value           uniform 200;
    }
}


// ************************************************************************* //
